app/controllers/application_controller.rb

  def current_order
    if Order.find_by_id(session[:order_id]).nil?
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" IS NULL LIMIT $1  [["LIMIT", 1]]