app/controllers/pages_controller.rb

SELECT "products".* FROM "products" LIMIT $1  [["LIMIT", 1]]
---
  def store
    @products = Product.all
    @categories = Category.all

    # GOOD: Preload products with their categories and group them.
    # This makes one efficient database query and prepares the data for the view.
    @products_by_category = Product.includes(:category).all.group_by(&:category)