app/controllers/phones_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def index
    @phones = Phone.order('id ASC').all